Repository: 84000/data-translation-memory
Catalog: toh48-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་རྨི་ལམ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། །
en: The Noble Mahāyāna Sūtra The Teaching on Dreams

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་དྲུག་ཁྲིའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཕལ་ཆེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པ་དག་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was residing on Vulture Peak Mountain at Rājagṛha together with a great assembly of 60,000 monks, most of whom had set out for unsurpassable, completely perfect awakening.

source: ཉན་ཐོས་ཆེན་པོ་མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པ་ཤ་སྟག་དང་ཡང་ཐབས་ཅིག་གོ། །
en: Present also was an assembly of great śrāvakas, all of whom had realized the various types of extrasensory cognitions.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཞལ་ཟས་ཀྱི་བྱ་བ་མཛད་ནས་འདི་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ། ཏིང་ངེ་འཛིན་དེའི་མཐུས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་འཁོར་དང་བཅས་པ་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་།
en: After finishing his meal, the Blessed One entered such a samādhi that through its power Śakra, Brahmā, and the world protectors with their retinues who were present within this trichiliocosm came to where the Blessed One was staying.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ནས་ཐལ་མོ་སྦྱར་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: After they arrived, they bowed their heads to the Blessed One’s feet and sat down to one side.

source: ཏིང་ངེ་འཛིན་དེའི་མཐུས་ཕྱོགས་བཅུ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ལྷགས་པའི་དགེ་སློང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་།
en: Through the power of the Buddha’s samādhi, every monk present in this great trichiliocosm came from the ten directions to where the Blessed One was staying.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: When they arrived, they prostrated, placing their heads at the feet of the Blessed One, and then sat down to one side.

source: ཏིང་ངེ་འཛིན་དེའི་མཐུས་འཁོར་བརྒྱད་ཀྱི་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་།
en: Through the power of that samādhi, every member of the eightfold assembly who was a practitioner of the Bodhisattva Vehicle also came to where the Blessed One was staying.

source: དེ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དགའ་བ་དང་། རབ་དགའ་དང་། རྟོགས་དགའ་དང་། བཟང་དགའ་དང་། དཔལ་བཟངས་དང་། ཡོངས་སུ་དགའ་ལྡན་དང་། དབང་ཕྱུག་དང་། དབང་ཕྱུག་ཆེན་པོ་ཞེས་བྱ་བ་རྣམས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རབ་ཏུ་མང་པོ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་།
en: Next, from the Pure Abodes came the gods Joyful, Extremely Joyful, Joy in Realization, Excellent Joy, Śrībhadra, Completely Joyful, Īśvara, and Maheśvara, who, accompanying a multitude of other gods from the Pure Abodes, arrived where the Blessed One was staying.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Once seated off to the side, the gods of the Pure Abodes addressed the Blessed One:

source: བཙུན་པ་བཅོམ་ལྡན་འདས་སྔོན་གྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་གསུངས་པ་བྱང་ཆུབ་སེམས་དཔའི་མཚན་མ་བསྟན་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་སྔོན་ཡང་བཤད་ལ་སླད་ཀྱིས་ཀྱང་འཆད་པར་འགྱུར་བས།
en: “Honorable Blessed One, the religious discourse called Teaching the Signs of a Bodhisattva was taught long ago by completely perfect buddhas and will be taught again in the future.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་། བདེ་བའི་སླད་དུ་དེ་ཡང་དག་པར་བཤད་དུ་གསོལ།
en: Therefore, we ask the Blessed One to teach it for the benefit of many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of gods and humans.

source: བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ན་ཡང་མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འདུན་པ་རྒྱ་ཆེན་པོ་སྐྱེད་པར་འགྱུར་ཞིང་།
en: Even after the Blessed One passes into parinirvāṇa, future bodhisattvas will hear this religious discourse and develop a powerful resolve to attain unsurpassable, completely perfect awakening.

source: བདག་ཉིད་ཀྱི་དགེ་བ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་ན་གཞན་དག་ལ་རློམ་སེམས་བགྱིད་པར་མི་འགྱུར་ཞིང་བདེ་བས་ཀྱང་བག་མ་མཆིས་པར་མི་འགྱུར་ལ།
en: When they see their own virtues exactly as they are, they will not feel conceited in relation to others, nor will they act heedlessly out of pleasure.

source: སྡུག་བསྔལ་བར་གྱུར་པས་ཀྱང་སྒྱིད་ལུག་པར་མི་འགྱུར་ལགས་སོ། །
en: Even if they experience suffering, they will not be despondent.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་ལ་ཅང་མི་གསུང་བས་གནང་བར་མཛད་དོ། །
en: The Blessed One assented by not saying anything to the gods of the Pure Abodes.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེས་རབ་འཇོམས་ཀྱིས་ལྷའི་བུ་དེ་དག་གིས་གསོལ་བ་བཏབ་པར་རིག་ཅིང་། འཁོར་མཐའ་ཡས་པ་དག་ལྷགས་པར་ཡང་རིག་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །ཡོན་ཏན་བརྒྱས་བལྟམས་པ་ལ་འདི་ཞུ་ལགས། །
en: Then the bodhisattva Vajrapramardin, who knew of the request made by those gods, and knew that a large assembly had arrived, spoke these verses: “I make this request of you, who are replete with a hundred good qualities.

source: ལྷ་མི་དགའ་མཛད་པ་ལ་འདི་ཞུ་ལགས། །
en: I make this request of you, who delights both gods and humans.

source: བདུད་འཇོམས་མཛད་པ་པོ་ལ་འདི་ཞུ་ལགས། །
en: I make this request of you, the defeater of Māra.

source: སྐྱེ་མང་སྨན་པའི་མཆོག་ལ་འདི་ཞུ་ལགས། །
en: I make this request of you, supreme doctor to many beings.

source: འཁྲུལ་མེད་གསུང་གིས་ཆོས་རྣམས་སྟོན་མཛད་ཅིང་། །
en: “You teach the Dharma with unerring speech.

source: འགྲོ་བའི་འཇིག་རྟེན་མཁས་པ་བླ་ན་མེད། །ཡིད་གཉིས་བརྒྱ་སྟོང་རབ་ཏུ་གཅོད་མཛད་ཅིང་། །
en: With learning unsurpassed in the world of beings, You cut through a hundred thousand doubts.

source: སྐྱེ་མང་མིག་སྩོལ་བ་ལ་འདི་ཞུ་ལགས། །
en: I make this request of you, who grants sight to beings.

source: ཉི་ལྟར་མཉམ་མེད་མུན་པ་སེལ་མཛད་ཅིང་། །ཟླ་ལྟར་ཡོངས་དག་བསིལ་བའི་འོད་ལྡན་པ། །
en: “Incomparable like the sun, you remove darkness; Pure like the moon, you shine cooling light.

source: མི་སྡུག་སྡུག་ལ་མི་གཡོ་ལྷུན་འདྲ་ཞིང་། །
en: You are unmoved by pleasure and pain, like Mount Meru.

source: མཚོ་འདྲ་ཡོན་ཏན་མཆོག་ལ་འདི་ཞུ་ལགས། །
en: I make this request of you, who has oceanic sublime qualities.

source: དོགས་བཞིན་དུ་ནོངས་པ་བགྱིས་བཟོད་ཅིང་། །
en: “Like the earth, you bear our wrongdoing.

source: ཆབ་ལྟར་སྐྱེ་དགུའི་དྲི་མ་སྦྱོང་བར་མཛད། །
en: Like water, you cleanse people’s impurities.

source: ཞུགས་བཞིན་ཉོན་མོངས་དྲ་བ་སྲེག་མཛད་ཅིང་། །
en: Like fire, you burn away webs of afflictions.

source: སྲིད་གསུམ་འཁོར་མི་མངའ་ལ་འདི་ཞུ་ལགས། །
en: I make this request of you, who does not cycle through the three worlds.

source: སྨན་པ་བཞིན་དུ་འགྲོ་བ་གསོ་མཛད་ཅིང་། །
en: “Like a doctor, you heal beings.

source: རྣམ་ཐོས་བུ་ལྟར་སྡུག་ལ་ནོར་སྦྱིན་མཛད། །
en: Like Vaiśravaṇa, you give wealth to those you favor.

source: སྤྲིན་བཞིན་སྐོམ་པས་གདུངས་པ་ཞི་མཛད་ཅིང་། །
en: Like a cloud, you appease those tormented by thirst.

source: དེས་པ་གསུང་མཆོག་སྟོན་ལ་འདི་ཞུ་ལགས། །
en: I make this request of you, valorous teacher with sublime speech.

source: འགྲོ་བ་ཟུག་རྔུ་སྡུག་བསྔལ་ང་རྒྱལ་བཅས། །ཐ་བ་ཉོན་མོངས་དྲི་བཅས་གཡོན་ཅན་དག །འདུལ་མཁས་བདེ་དང་བདེ་བ་སྩོལ་མཛད་ཅིང་། །
en: “Skilled in discipline, you grant happiness upon happiness To prideful beings beset with painful suffering, And to villains rife with the stains of harsh afflictions.

source: འགྲོ་བས་དྲན་བགྱི་བ་ལ་མཆོག་འདི་ཞུ། །
en: I request this boon of you, whom beings call to mind.

source: འཛེམ་དང་སྣང་ལྡན་བློ་གྲོས་བརྟན་ལྡན་ཞིང་། །རྟོགས་དང་དྲན་ལྡན་བླ་མ་རྣམས་ཀྱིས་མཆོད། །
en: “You are worshiped by masters modest and radiant, Those of steadfast intellect who are realized and reflective.

source: མཉམ་མེད་ཚུལ་མི་འཆོས་ཤིང་ཐུགས་མི་གནས། །ཡོན་ཏན་རྒྱ་མཚོ་འདྲ་ལ་མཆོག་འདི་ཞུ། །
en: Unequaled, guileless, and unbiased, I request this boon of you, whose qualities are oceanic.

source: སྐྱེ་དགུའི་འཐབ་རྩོད་ཉོན་མོངས་ཞི་མཛད་ཅིང་། །
en: “You pacify the afflictions that cause strife among people.

source: རྟག་ཏུ་དེས་ཤིང་ཞལ་བཟང་དགའ་བར་མཛད། །
en: Ever valorous, your beautiful face is a source of joy.

source: ཤིན་ཏུ་ཞལ་འཛུམ་མཉེན་ཞིང་བྱམས་པའི་ཐུགས། །
en: You have a gentle smile and a loving heart.

source: སྲིད་གསུམ་ཕ་རོལ་གཤེགས་ལ་འདི་ཞུ་ལགས། །
en: I make this request of you, who has gone beyond the three worlds.

source: སོར་བཅུ་ཐལ་སྦྱར་འདི་ཡིས་བསྟོད་བགྱིས་ཤིང་། །
en: “With our ten fingers pressed together we make this praise to you.

source: བདེ་གཤེགས་སྟོབས་བཅུ་ཁྱོད་ལ་གསོལ་འདེབས་ཀྱིས། །
en: I appeal to you, Sugata possessing the ten powers.

source: སེམས་ཅན་རིན་ཆེན་དེ་དག་རྣམས་ཀྱི་སྤྱོད། །ཞུས་པ་བཞིན་དུ་བཀའ་སྩོལ་བཤད་དུ་གསོལ། །
en: In accordance with this request, please instruct us In the conduct of those jewels among beings.

source: བྱང་ཆུབ་ཚུལ་གྱི་སྤྱོད་དེ་ཅི་འདྲ་བ། །ཐོས་ན་ལྷ་མི་ཚོགས་ཀྱང་སྤྱོད་འགྱུར་བས། །
en: “If they hear what the conduct of awakening is like, The hosts of gods and humans would adopt it as well.

source: འདི་ནི་སྐྱེ་མཆོག་ལགས་ཞེས་བདག་ཅག་གིས། །ཇི་ལྟར་འཚལ་འགྱུར་མཚན་མ་བདག་ལ་གསུངས། །
en: Please tell me of their signs as I’ve asked, So that I may know ‘This is a supreme person.’ ”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེས་རབ་འཇོམས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རྡོ་རྗེས་རབ་འཇོམས་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: The Blessed One then said to the bodhisattva mahāsattva Vajrapramardin, “Vajrapramardin, listen carefully and be attentive.

source: རྣམ་པ་གང་དག་དང་། རྟགས་གང་དག་དང་། མཚན་མ་གང་དག་གིས་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་ཡིན་པར་ཤེས་པར་བྱ་བ་ངས་ཁྱོད་ལ་བཤད་པར་བྱའོ། །
en: I will explain to you the features, indications, and signs by which individuals following the Bodhisattva Vehicle can be recognized.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེས་རབ་འཇོམས་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་ལྟར་འཚལ་ལོ་ཞེས་གསོལ་ཏོ། །
en: The bodhisattva Vajrapramardin replied to the Blessed One, “Such is my request.”

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: He then listened as the Blessed One instructed.

source: རྡོ་རྗེས་རབ་འཇོམས་མཚན་མ་བརྒྱ་རྩ་བརྒྱད་ཀྱིས་ནི་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ།
en: The Blessed One said to him, “Vajrapramardin, those who follow the Bodhisattva Vehicle may be recognized through one hundred and eight signs.

source: བརྒྱ་རྩ་བརྒྱད་གང་ཞེ་ན།
en: What are the one hundred and eight signs?

source: གཉིད་ལོག་པའི་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཛེས་པས་བཀའ་སྩོལ་བའི་གཟུགས་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཅང་མི་གསུང་བ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དབུ་དང་ཞབས་སུ་བཅས་པར་གཡོགས་པ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཞལ་ཕྱིར་ཕྱོགས་པ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་འཇིམ་པ་ལས་བྱས་པ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚོན་གྱིས་བྲིས་པ་མཐོང་བ་དང་། གཞན་ཡང་འགྲོ་བ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་གཞན་དག་ལ་ཆོས་སྟོན་པར་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་རྫུ་འཕྲུལ་གྱིས་ནམ་མཁའ་ལ་གཤེགས་པ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་མཐོང་བ་དང་།
en: “While asleep and dreaming, (1) seeing an image of the beautiful form of the Tathāgata speaking; (2) seeing the Tathāgata remain silent; (3) seeing the Tathāgata covered from head to toe; (4) seeing the Tathāgata with his face averted; (5) seeing the form of the Tathāgata fashioned out of clay; (6) seeing the form of the Tathāgata drawn in color; (7) seeing an image of the Tathāgata while walking; (8) seeing the Tathāgata teaching the Dharma to others; (9) seeing the Tathāgata miraculously flying through the sky; (10) seeing the Tathāgata pass into parinirvāṇa;

source: གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཞུགས་ལ་བཞེན་པ་མཐོང་བ་དང་། གཞན་ཡང་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དག་རྙེད་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་དབུ་སྐྲ་རྙེད་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་སྔོན་མ་མཐོང་བའི་མཆོད་རྟེན་དག་མཐོང་བ་དང་། གཞན་ཡང་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་རིན་པོ་ཆེས་བརྒྱན་པ་དག་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ཆོ་འཕྲུལ་མཛད་པ་དག་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་འོད་མཐོང་བ་དང་། གཞན་ཡང་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྒྲ་ཐོས་ལ་མ་མཐོང་བ་དང་། གཞན་ཡང་བདག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡིན་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་མེ་ཏོག་གམ། མེ་ཏོག་ཕྲེང་ངམ། སྤོས་སམ། བྱུག་པ་འབུལ་ཞིང་སྐུད་པར་ཀུན་ཏུ་ཤེས་པ་དང་།
en: (11) seeing the Tathāgata being cremated; (12) in a dream, finding the Tathāgata’s physical relics; (13) in a dream, finding the Tathāgata’s hair; (14) in a dream, seeing caityas that have never been seen before; (15) in a dream, seeing jeweled caityas of the Tathāgata; (16) seeing caityas of the Tathāgata performing miracles; (17) seeing the radiance of the Tathāgata; (18) in a dream, hearing but not seeing the Tathāgata; (19) perceiving themselves to have the form of the Tathāgata; (20) perceiving themselves to be the flowers, flower garlands, fragrances, or unguents that are offered to or used to anoint a caitya of the Tathāgata;

source: གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་ན་བཟའ་དྲི་མ་ཅན་གསོལ་བ་མཐོང་བ་དང་། གཞན་ཡང་རྨི་ལམ་ན་སྔོན་མ་ཐོས་པའི་ཆོས་དག་ཐོས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་མ་བསྟན་པའི་ཆོས་དག་ཤེས་ལ་སད་ན་ཆོས་འཆད་པ་སུ་ཡང་མེད་ཅིང་ཅི་ཡང་མི་དྲན་པ་དང་། སྔོན་མ་མཐོང་བའི་དགེ་སློང་ཆོས་སྨྲ་བ་དག་མཐོང་བ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་ཆོས་ཀྱི་ཁྲི་སྟན་ལ་འདུག་སྟེ་ཆོས་སྟོན་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་འཇིགས་པ་མེད་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་འཆག་པ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་མཆོད་རྟེན་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་རྙེད་པ་དང་།
en: (21) seeing the Tathāgata wearing dirty clothes; (22) in a dream, hearing teachings that have never been heard before; (23) in a dream, understanding Dharma teachings that were not taught, and upon waking, being unable to recall anything about the teachings that have not been taught by anyone; (24) seeing a Dharma-teaching monk who had never been seen before; (25) in a dream, perceiving themselves sitting atop a Dharma throne teaching the Dharma; (26) in a dream, perceiving themselves to be fearless; (27) in a dream, seeing the seat of awakening; (28) seeing the Tathāgata walking; (29) seeing the Tathāgata turning the wheel of Dharma; (30) seeing the Tathāgata’s parinirvāṇa stūpa;

source: གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ལྷུང་བཟེད་རྙེད་པ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཉག་གཅིག་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་སྐྱེ་བོ་མང་པོས་ཡོངས་སུ་བསྐོར་བ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་གདུགས་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་འཆགས་དག་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་གདན་མཐོང་བ་དང་། གཞན་ཡང་བདག་དེ་བཞིན་གཤེགས་པ་ལ་ཞལ་ཟས་འབུལ་བར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་འབུལ་བར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་འབུལ་བར་ཀུན་ཏུ་ཤེས་པ་དང་།
en: (31) finding the Tathāgata’s robe; (32) finding the Tathāgata’s alms bowl; (33) seeing the Tathāgata all alone; (34) seeing the Tathāgata surrounded by many people; (35) seeing the Tathāgata’s parasol; (36) seeing a place visited by the Tathāgata; (37) seeing the Tathāgata’s seat; (38) perceiving themselves offering food to the Tathāgata; (39) perceiving themselves offering clothes to the Tathāgata; (40) perceiving themselves offering flowers to the Tathāgata;

source: གཞན་ཡང་བདག་རི་ལ་འདུག་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་གཅེར་བུར་འདུག་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་ཕྱོགས་མཚམས་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་སྔོན་མ་མཐོང་བའི་ཡུལ་དུ་ཕྱིན་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་ཆུ་བོའི་ནང་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་སྤྲིན་ལས་ཆར་འབབ་པ་མཐོང་བ་དང་། གཞན་ཡང་རྨི་ལམ་ནས་གཡོས་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་གཡུལ་འགྱེད་པའི་ནང་དུ་སོན་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་ན་བར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་གཡང་ས་ནས་གཡང་དུ་ལྷུང་ཞིང་རྟོན་པ་མེད་པར་ཀུན་ཏུ་ཤེས་པ་དང་།
en: (41) perceiving themselves on a mountain; (42) in a dream, perceiving themselves to be naked; (43) in a dream, perceiving themselves to be in an intermediate direction; (44) in a dream, perceiving themselves going to a region never visited before; (45) in a dream, perceiving themselves to be in a river; (46) in a dream, seeing rain falling from the clouds; (47) in a dream, experiencing an earthquake; (48) in a dream, perceiving themselves to be in the midst of battle; (49) in a dream, perceiving themselves to be ill; (50) in a dream, perceiving themselves falling off a precipice into an abyss, unable to catch hold;

source: གཞན་ཡང་རྨི་ལམ་ན་བདག་གསད་པ་ལས་བཏང་བར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་དགྲའི་ནང་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་ནམ་མཁའ་ལ་འགྲོ་བར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་གིས་ལག་པ་ན་སྒྲོན་མ་ཐོགས་པ་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་ཕྱུང་བ་མཐོང་བ་དང་། གཞན་ཡང་རྨི་ལམ་ན་གླེགས་བམ་རྙེད་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་གཟུངས་ཀྱི་སྒྲ་ཐོས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་ཐོས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་ཤིན་ཏུ་རྒྱས་པའི་སྡེའི་མདོ་སྡེའི་སྒྲ་ཐོས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་ཆོས་སྨྲ་བའི་དགེ་སློང་ཆེ་གེ་མོ་ཞེས་བྱ་བ་རྣམས་ཀྱི་མིང་ཐོས་པ་དང་།
en: (51) in a dream, perceiving themselves avoiding being killed; (52) in a dream, perceiving themselves among enemies; (53) in a dream, perceiving themselves flying through the sky; (54) in a dream, perceiving themselves holding a lamp; (55) in a dream, seeing a bodhisattva departing; (56) in a dream, finding a book; (57) in a dream, hearing the sound of a dhāraṇī; (58) in a dream, hearing the sound of samādhi; (59) in a dream, hearing the sound of the sūtras from among the extensive discourses; (60) in a dream, hearing the names of Dharma-teaching monks named ‘so-and-so’;

source: གཞན་ཡང་རྨི་ལམ་ན་བདག་ཚིགས་སུ་བཅད་པ་ལ་སྤོབས་པ་ཐོབ་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་མདོ་སྡེ་ལ་སྤོབས་པ་ཐོབ་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་ཆོས་ཀྱི་གཏེར་གྱི་སྒྲ་ཐོས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་འཇིག་རྟེན་གྱི་ཁམས་གཞན་གྱི་དེ་བཞིན་གཤེགས་པའི་མཚན་ཐོས་པ་དང་། གཞན་ཡང་འཇིག་རྟེན་གྱི་ཁམས་གཞན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་ཆེ་གེ་མོ་ཞེས་བྱ་བའི་མིང་ཐོས་པ་དང་། གཞན་ཡང་བདག་རྒྱ་མཚོའི་དབུས་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རིན་པོ་ཆེ་དག་ཐུ་བར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རི་རབ་ཀྱི་རྩེ་མོར་སོན་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རི་ལ་འཛེག་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རིའི་རྩེ་མོ་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་པ་དང་།
en: (61) in a dream, perceiving that they have gained confident eloquence in the verses; (62) in a dream, perceiving that they have gained confident eloquence in the sūtras; (63) in a dream, hearing the sound of a Dharma treasure; (64) in a dream, hearing the name of a tathāgata from another world system; (65) hearing about a certain bodhisattva named ‘so-and-so’ from another world system; (66) perceiving themselves to be in the middle of an ocean; (67) perceiving themselves collecting jewels; (68) perceiving themselves reaching the summit of Mount Meru; (69) perceiving themselves ascending a mountain; (70) perceiving themselves on a mountain peak;

source: གཞན་ཡང་བདག་ཤིང་ལྗོན་པ་ལ་འཛེག་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་གླང་པོ་ཆེའི་གཙོ་བོ་མཐོང་བ་དང་། གཞན་ཡང་བདག་གླང་པོ་ཆེའི་གཙོ་བོ་ལ་ཞོན་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རྟ་ལ་ཞོན་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་བདེན་པའི་བྱིན་གྱི་རླབས་བྱེད་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་འབྲས་བུའི་ཤིང་ལྗོན་པ་དག་མཐོང་བ་དང་། གཞན་ཡང་མེ་ཏོག་གི་ཤིང་ལྗོན་པ་དག་མཐོང་བ་དང་། གཞན་ཡང་སྔོན་མ་མཐོང་བའི་གྲོང་ཁྱེར་མཐོང་བ་དང་། གཞན་ཡང་མཚོ་མ་དྲོས་པ་མཐོང་བ་དང་། གཞན་ཡང་ལྷའི་བུ་མཐོང་བ་དང་།
en: (71) perceiving themselves climbing a tree; (72) seeing the best of elephants; (73) perceiving themselves to be riding the best of elephants; (74) perceiving themselves riding a horse; (75) perceiving themselves performing an act of truth; (76) seeing a fruit tree; (77) seeing a flowering tree; (78) seeing a city never seen before; (79) seeing Lake Anavatapta; (80) seeing a god;

source: གཞན་ཡང་ཀླུ་མཐོང་བ་དང་། གཞན་ཡང་བདག་འཛམ་བུའི་གླིང་གཞན་དུ་སོན་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་གོས་དཀར་པོ་གྱོན་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་གི་མགོ་ལ་རིན་པོ་ཆེའི་ཕྲེང་བ་ཐོགས་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་གི་མགོ་ལ་མེ་ཏོག་གི་ཕྲེང་བ་རྒྱན་དང་བཅས་པ་ཐོགས་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་མེ་ཏོག་སིལ་མ་དག་སྲེལ་བར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རྔ་བོ་ཆེ་རྡུང་བའམ། རོལ་མོའི་སྒྲ་གཞན་དག་འབྱིན་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་ཉི་མ་སྤྱང་ཀིས་ཟིན་པ་འམ། ཟླ་བ་སྤྱང་ཀིས་ཟིན་པར་མཐོང་བ་དང་། གཞན་ཡང་བདག་མི་གཙང་བས་འབགས་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རྒྱལ་པོར་གྱུར་པར་ཀུན་ཏུ་ཤེས་པ་དང་།
en: (81) seeing a nāga; (82) perceiving themselves to be traveling to another Jambudvīpa; (83) perceiving themselves wearing white clothes; (84) perceiving themselves wearing a garland of jewels on their head; (85) perceiving themselves wearing an ornamented garland of flowers on their head; (86) perceiving themselves holding flower petals; (87) perceiving themselves beating a great drum or making other musical sounds; (88) watching a wolf seize the sun or the moon; (89) perceiving themselves to be covered in filth; (90) perceiving themselves to be a king;

source: གཞན་ཡང་བདག་རྒྱལ་པོའི་སྤྱན་སྔ་འམ། རྒྱལ་པོའི་བློན་པོ་ཆེན་པོ་འམ། སྐྱེ་བོ་ཕལ་པོ་ཆེའི་ནང་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་སྐྱེད་མོས་ཚལ་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་སྔོན་མ་མཐོང་བའི་གཙུག་ལག་ཁང་ངམ། གྲོང་ངམ། ཡུལ་ལམ། ལྗོངས་མཐོང་བ་དང་། གཞན་ཡང་རྨི་ལམ་ན་གདུགས་རྙེད་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ལ་ཆོས་སྟོན་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་གྲོང་གཞན་དུ་ཞུགས་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་ཟམ་པ་འདོགས་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་གྲུ་སྦྱོར་བར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་སྤྲིན་ལས་འབྲུག་གྲག་པའམ། གློག་འབྱུང་བར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་མཚོན་ཆ་འམ་གོ་ཆ་རྙེད་པ་དང་།
en: (91) perceiving themselves to be in the presence of a king, the king’s prime minister, or a large crowd of people; (92) perceiving themselves to be in a garden; (93) seeing a monastery, town, region, or country never seen before; (94) in a dream, finding a parasol; (95) in a dream, perceiving themselves to be teaching the Dharma to a large group of people; (96) perceiving themselves entering another city; (97) perceiving themselves constructing a bridge; (98) perceiving themselves using a boat; (99) in a dream, perceiving thunder and lightning coming from clouds; (100) in a dream, finding weapons or armor;

source: གཞན་ཡང་རྨི་ལམ་ན་སྣོད་དག་རྙེད་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་སེམས་ཅན་རྣམས་ལ་ལམ་སྟོན་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་སྐྱེད་མོས་ཚལ་དུ་འཇུག་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པ་མཐོང་བ་དང་། གཞན་ཡང་བདག་སེམས་ཅན་ནད་པ་རྣམས་གསོ་བར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པའི་སྒྲ་ཐོས་པ་དང་། གཞན་ཡང་བདག་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་ཀུན་ཏུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བུམ་པ་གང་བ་དག་རྙེད་པ་སྟེ།
en: (101) finding vessels; (102) in a dream, perceiving themselves revealing a path to beings; (103) in a dream, perceiving themselves entering a pleasure garden; (104) in a dream, seeing a bountiful harvest; (105) perceiving themselves caring for sick beings; (106) hearing a prediction of their awakening; (107) perceiving that they have reached completely perfect awakening; and (108) in a dream, finding a full pot.

source: རྡོ་རྗེས་རབ་འཇོམས་རྨི་ལམ་གྱི་མཚན་མ་བརྒྱ་རྩ་བརྒྱད་པོ་འདི་དག་ཀུན་ཏུ་སྣང་ན་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: “Vajrapramardin, if these one hundred and eight dream signs appear, you should recognize those individuals as practitioners of the Bodhisattva Vehicle. 1.

source: རྡོ་རྗེས་རབ་འཛོམས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པས་བཀའ་སྩལ་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་གལ་ཏེ་གཟུངས་ཐོབ་པར་གྱུར་པ་ཞིག་གམ། མངོན་པར་ཤེས་པ་ཐོབ་པར་གྱུར་པ་ཞིག་གམ། བདེན་པའི་བྱིན་གྱིས་བརླབས་གྲུབ་པར་གྱུར་པ་ཞིག་ཡིན་ན་ནི་ས་བརྒྱད་པར་ལུང་བསྟན་པར་འགྱུར་བར་བལྟའོ། །
en: “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata speaking, and if those bodhisattvas have obtained the power of dhāraṇī, have obtained the extrasensory cognitions, or have performed an act of truth, see that as an indication that they are on the eighth bhūmi.
